app/controllers/categories_controller.rb

  def update
    if @category.update(category_params)
---
UPDATE `categories` SET `categories`.`categoryName` = 'dfgh', `categories`.`description` = 'dhgjhff', `categories`.`updated_at` = '2020-02-15 10:43:58.316306' WHERE `categories`.`id` = 42