app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO `categories` (`categoryName`, `description`, `created_at`, `updated_at`) VALUES ('ggg', 'gggg', '2020-02-15 10:27:05.461128', '2020-02-15 10:27:05.461128')

  def productCategory
    ProductCategory.create(product: @product, category: @category);
---
INSERT INTO `product_categories` (`product_id`, `category_id`, `created_at`, `updated_at`) VALUES (1, 42, '2020-02-15 11:09:08.946974', '2020-02-15 11:09:08.946974')

  def destroyproductCategory
    puts "error"
    productCategory = ProductCategory.where(product_id: @product.id, category_id:  @category.id)
---
SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`product_id` = 1 AND `product_categories`.`category_id` = 1 ORDER BY `product_categories`.`id` ASC LIMIT 1

  def CategoryProd
    productCategory = ProductCategory.joins(:product).select('productName').where(category_id:  @category.id)
---
SELECT productName FROM `product_categories` INNER JOIN `products` ON `products`.`id` = `product_categories`.`product_id` WHERE `product_categories`.`category_id` = 2

  def CategoryPro
    # productCategory = ProductCategory.where(category_id:  @category.id).first;
    productCategory = ProductCategory.all
---
SELECT `product_categories`.* FROM `product_categories`

  def update
    if @categyor.update(category_params)
---
UPDATE `categories` SET `categories`.`categoryName` = 'dfgh', `categories`.`description` = 'dhgjhff', `categories`.`updated_at` = '2020-02-15 10:43:58.316306' WHERE `categories`.`id` = 42

    def set_category_prod
      data = params.permit(:categoryId)
      @category = Category.find(data[:categoryId]);
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

    def set_category_product
      data = params.permit(:categoryId, :productId)
      @category = Category.find(data[:categoryId]);
      @product = Product.find(data[:productId]);
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1