app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT `customers`.* FROM `customers`

  def create
    @customer = Customer.new(customer_params)

    if @customer.save
---
INSERT INTO `customers` (`customerName`, `contactName`, `address`, `city`, `postalCode`, `country`, `created_at`, `updated_at`) VALUES ('aghgashas', 'jasjxbxasbxn', 'nanxnaxnb', 'nnbxjbasxb', 'nbxkjasbx', 'xbjbaxbaxb', '2020-03-15 19:11:25.344258', '2020-03-15 19:11:25.344258')

  def update
    if @customer.update(customer_params)
---
UPDATE `customers` SET `customers`.`customerName` = 'asd', `customers`.`contactName` = 'asd', `customers`.`address` = 'asd', `customers`.`city` = 'asd', `customers`.`postalCode` = 'asd', `customers`.`country` = 'asd', `customers`.`updated_at` = '2020-03-16 16:20:00.236152' WHERE `customers`.`id` = 21

  def getAllOrderDatilsCust
    # ordcust =
    customers = OrderDetail.joins(:order => :customer ).select('quantity','customerName','orderDate').where(customer_id: @customer.id)
---
SELECT productName, `order_details`.`quantity`, customer_id, customerName, orderDate FROM `order_details` INNER JOIN `products` ON `products`.`id` = `order_details`.`product_id` INNER JOIN `orders` ON `orders`.`id` = `order_details`.`order_id` INNER JOIN `customers` ON `customers`.`id` = `orders`.`customer_id` WHERE `order_details`.`customer_id` = 18
SELECT quantity, `orders`.`customer_id`, customerName, `orders`.`orderDate` FROM `orders` INNER JOIN `customers` ON `customers`.`id` = `orders`.`customer_id` INNER JOIN `order_details` ON `order_details`.`order_id` = `orders`.`id` WHERE `orders`.`customer_id` = 18

  def destroy
    @customer.destroy
---
DELETE FROM `customers` WHERE `customers`.`id` = 21

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1

    def find_customerId
      data = params.permit(:customerId)
      @customer = Customer.find(data[:customerId]);
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 18 LIMIT 1