app/controllers/employees_controller.rb

INSERT INTO `employees` (`lastName`, `firstName`, `notes`, `created_at`, `updated_at`) VALUES ('assssssssss', 'ssssssssss', 'sssssssss', '2020-03-16 20:22:16.038521', '2020-03-16 20:22:16.038521')
---
  def create
    @employee = Employee.new(employee_params)

    if @employee.save

UPDATE `employees` SET `employees`.`lastName` = 'asd', `employees`.`firstName` = 'asd', `employees`.`birthDay` = '1111-11-11 00:00:00', `employees`.`notes` = 'asd', `employees`.`updated_at` = '2020-03-16 21:11:35.762807' WHERE `employees`.`id` = 21
---
  def update
    if @employee.update(employee_params)

DELETE FROM `employees` WHERE `employees`.`id` = 23
---
  def destroy
    @employee.destroy

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
    def set_employee
      @employee = Employee.find(params[:id])