app/controllers/products_controller.rb

  def create
    @products = Product.new(product_params)

    if @products.save
---
INSERT INTO `products` (`productName`, `unit`, `price`, `supplier_id`, `created_at`, `updated_at`) VALUES ('Linguine with Clams', '1kg', 200, 1, '2020-03-17 00:43:51.030509', '2020-03-17 00:43:51.030509')

  def update
    if @products.update(product_params)
---
UPDATE `products` SET `products`.`productName` = 'Xndzor', `products`.`unit` = '5kg', `products`.`price` = 150, `products`.`supplier_id` = 5, `products`.`updated_at` = '2020-03-17 17:45:54.750581' WHERE `products`.`id` = 42

  def destroy
    @products.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 43

    def set_product
      @products = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 5 LIMIT 1