app/controllers/product_category_controller.rb

  def productCategory
    ProductCategory.create(product: @product, category: @category);
---
INSERT INTO `product_categories` (`product_id`, `category_id`, `created_at`, `updated_at`) VALUES (15, 1, '2020-02-16 22:41:55.475969', '2020-02-16 22:41:55.475969')

  def destroyproductCategory
    puts "error"
    productCategory = ProductCategory.where(product_id: @product.id, category_id:  @category.id)
---
SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`product_id` = 3 AND `product_categories`.`category_id` = 3

  def CategoryProd
    productCategory = ProductCategory.joins(:product).select('productName').where(category_id:  @category.id)
---
SELECT productName FROM `product_categories` INNER JOIN `products` ON `products`.`id` = `product_categories`.`product_id` WHERE `product_categories`.`category_id` = 2

  def CategoryProdAll
    productCategoryAll = ProductCategory.joins(:product, :category).select('productName', 'categoryName' )
---
SELECT productName, categoryName FROM `product_categories` INNER JOIN `products` ON `products`.`id` = `product_categories`.`product_id` INNER JOIN `categories` ON `categories`.`id` = `product_categories`.`category_id`

  def CategoryPro
    # productCategory = ProductCategory.where(category_id:  @category.id).first;
    productCategory = ProductCategory.all
---
SELECT `product_categories`.* FROM `product_categories`

  def set_category_product
    data = params.permit(:categoryId, :productId)
    @category = Category.find(data[:categoryId]);
    @product = Product.find(data[:productId]);
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 15 LIMIT 1

  def set_category_prod
    data = params.permit(:categoryId)
    @category = Category.find(data[:categoryId]);
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1