app/controllers/shippers_controller.rb

SELECT `shippers`.* FROM `shippers`
---
  def index
    @shippers = Shipper.all

UPDATE `shippers` SET `shippers`.`shipperName` = 'Hovik', `shippers`.`phone` = '1111111111111', `shippers`.`updated_at` = '2020-02-12 21:05:30.999576' WHERE `shippers`.`id` = 20
---
  def update
    if @shipper.update(shipper_params)

SELECT `shippers`.* FROM `shippers` WHERE `shippers`.`id` = 20 LIMIT 1
---
    def set_shipper
      @shipper = Shipper.find(params[:id])