app/controllers/suppliers_controller.rb

SELECT `suppliers`.* FROM `suppliers`
---
  def index
    @suppliers = Supplier.all

INSERT INTO `suppliers` (`supplierName`, `contactName`, `address`, `city`, `postalCode`, `country`, `phone`, `created_at`, `updated_at`) VALUES ('string', 'string', 'string', 'string', 'string', 'string', 'string', '2020-02-01 14:47:48.080761', '2020-02-01 14:47:48.080761')
---
  def create
    @supplier = Supplier.new(supplier_params)

    if @supplier.save

SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1
---
    def set_supplier
      @supplier = Supplier.find(params[:id])